src/FedexAPI/FedExWebServices/wsdl/Tracking Transaction/SignatureProofOfDeliveryLetterRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/track/v12">
   <soapenv:Header/>
   <soapenv:Body>
      <v12:SignatureProofOfDeliveryLetterRequest>
       <v12:WebAuthenticationDetail>
<v12:UserCredential>
               <v12:Key>Input Your Information</v12:Key>
               <v12:Password>Input Your Information</v12:Password>
            </v12:UserCredential>
         </v12:WebAuthenticationDetail>
         <v12:ClientDetail>
            <v12:AccountNumber>Input Your Information</v12:AccountNumber>
            <v12:MeterNumber>Input Your Information</v12:MeterNumber>
       </v12:ClientDetail>   
 <v12:TransactionDetail>
            <v12:CustomerTransactionId>SignatureProofOfDeliveryLetterRequest_v12</v12:CustomerTransactionId>
            <v12:Localization>
               <v12:LanguageCode>EN</v12:LanguageCode>
            </v12:Localization>
         </v12:TransactionDetail>
         <v12:Version>
            <v12:ServiceId>trck</v12:ServiceId>
            <v12:Major>12</v12:Major>
            <v12:Intermediate>0</v12:Intermediate>
            <v12:Minor>0</v12:Minor>
         </v12:Version>
         <v12:QualifiedTrackingNumber>
            <v12:TrackingNumber>Input Your Information</v12:TrackingNumber>
            <v12:ShipDate>2015-12-29</v12:ShipDate>
            <v12:AccountNumber>Input Your Information</v12:AccountNumber>
            <v12:Carrier>FDXE</v12:Carrier>
            <v12:Destination>
               <v12:StreetLines>Input Your Information</v12:StreetLines>
               <v12:City>Texas</v12:City>
               <v12:StateOrProvinceCode>TX</v12:StateOrProvinceCode>
               <v12:PostalCode>73301</v12:PostalCode>
               <v12:CountryCode>US</v12:CountryCode>
            </v12:Destination>
         </v12:QualifiedTrackingNumber>
         <v12:LetterFormat>PNG</v12:LetterFormat>
         <v12:Consignee>
            <v12:Contact>
               <v12:PersonName>Input Your Information</v12:PersonName>
               <v12:Title>Input Your Information</v12:Title>
               <v12:CompanyName>Input Your Information</v12:CompanyName>
               <v12:PhoneNumber>Input Your Information</v12:PhoneNumber>
               <v12:PhoneExtension>Input Your Information</v12:PhoneExtension>
               <v12:PagerNumber>Input Your Information</v12:PagerNumber>
               <v12:FaxNumber>Input Your Information</v12:FaxNumber>
               <v12:EMailAddress>Input Your Information</v12:EMailAddress>
            </v12:Contact>
            <v12:Address>
               <v12:StreetLines>Input Your Information</v12:StreetLines>
               <v12:City>INDIANAPOLIS</v12:City>
               <v12:StateOrProvinceCode>IN</v12:StateOrProvinceCode>
               <v12:PostalCode>46279</v12:PostalCode>
               <v12:CountryCode>US</v12:CountryCode>
            </v12:Address>
         </v12:Consignee>
      </v12:SignatureProofOfDeliveryLetterRequest>
   </soapenv:Body>
</soapenv:Envelope>